def age(data_age):
    '''
    Функция age(ndata_age) принимает год и выводит век в римских цифрах
    -------------------------------------
    Описание переменных для функции
    -------------------------------------
    Формальные параметры функции
    data_age : дата, тип - 'str'
    -------------------------------------
    Локальные переменные функции
    a : значение единицы
    b : значение десятка
    -------------------------------------
    Результат функции
    return : data_age : век, тип - 'str'

    '''

    data_age = int(data_age)//100 + 1
    a = data_age % 10
    if a>4 and a<9:
        a = 'V'+'I'*(a-5)
    elif a == 4:
        a = 'I'+'V'
    elif a == 9:
        a = 'I'+'X'
    else:
        a = 'I'*a
    data_age = data_age//10
    b = ''
    while data_age != 0:
        b = data_age % 10
        b = 'X' * b
        data_age = data_age//10
    data_age = b + a
    return data_age


